Repository: shuzhzh/TreeletHub
Catalog: TreeletHub/Localizable.xcstrings
Source language: en
Languages: zh_hans

# guide.body.ai_pad
source: Put ChatGPT, Codex, or Cursor into the hub grid, then tap it on iPhone: instead of just launching the app, your phone becomes a dedicated controller for that agent, and the whole vibe-coding loop moves into your hand. Kick off a run, approve or redirect what the agent proposes, tune how hard it thinks, and jump between chat, edits, and the terminal — the model keeps working while you stay in the flow, phone in hand and away from the keyboard. ChatGPT, Codex, and Cursor each get a layout tuned to how you actually drive them, and every control is remappable to fit your workflow. The Mac needs Accessibility and Automation permission for TreeletHub — without it the controller shows a warning and the keys do nothing.
zh_hans: 把 ChatGPT、Codex 或 Cursor 放进九宫格，在 iPhone 上点按它：手机不再只是启动应用，而是变成这个 agent 的专属控制器，整个 vibe coding 循环都握在手里。发起一次运行、批准或纠偏 agent 的提议、调节它思考的深浅、在对话 / 改动 / 终端之间切换——模型持续推进，你握着手机、离开键盘也能保持心流。 ChatGPT、Codex、Cursor 各有贴合你实际操作方式的布局，且每个控件都能自定义映射。 Mac 需要为 TreeletHub 开启「辅助功能」与「自动化」权限，否则控制器会提示未授权、按键无效。

# guide.body.connect_ios
source: 1) On the Mac, open TreeletHub and read the six-digit pairing code. 2) On iPhone, open Connect to Mac, type the code, then tap Connect. 3) The first time, allow Local Network access when iOS prompts you—without it, the phone cannot discover the Mac.
zh_hans: 1）在 Mac 上打开 TreeletHub，记下界面上的 6 位配对码。 2）在 iPhone 的「连接 Mac」中输入配对码并点击连接。 3）首次连接请在系统提示中允许「本地网络」，否则无法发现 Mac。

# guide.body.gestures_ios
source: On the Apps grid while paired: swipe down with two fingers to hide every open Mac app—including TreeletHub—and show the desktop.
zh_hans: 已配对时在 Apps 九宫格上：双指下滑会隐藏 Mac 上全部已打开应用（含 TreeletHub 自身）以显示桌面。

# guide.body.push_to_talk
source: 1) Hold the PTT key on the control pad and speak—the words you say appear on the phone in real time. 2) Recognition runs on the iPhone itself. No audio leaves the phone; only the finished text travels across your Wi‑Fi to the Mac. 3) Let go and the text lands in the ChatGPT / Codex / Cursor composer on the Mac. Read it over, then tap Send. Double-tap PTT within 350 ms for hands-free recording, and tap once more to stop. The first time you use it, allow Microphone and Speech Recognition on the iPhone.
zh_hans: 1）在控制键盘上按住「PTT」键说话，手机上会实时显示识别出的文字。 2）识别全程在 iPhone 本机完成，音频不会离开手机，只有最终文字经 Wi‑Fi 发送到 Mac。 3）松手后文字会自动填入 Mac 上 ChatGPT / Codex / Cursor 的输入框，确认无误后点「Send」发送。 350 毫秒内双击 PTT 可进入免提录音，再点一次结束。首次使用请允许 iPhone 的「麦克风」与「语音识别」权限。

# guide.body.scenarios
source: Keep TreeletHub running on the desk Mac. From the couch or another room, use your iPhone as a remote launcher for apps you already placed in the hub.
zh_hans: Mac 上常驻 TreeletHub；你在客厅或别的房间，用 iPhone 快速唤起已放进九宫格的 Mac 应用。

# guide.body.setup_ios
source: Use the Apps tab for the live grid. In Settings, rename how your iPhone appears on the Mac, change the backdrop, or swap your one saved photo background.
zh_hans: 在「Apps」使用实时九宫格；在「设置」里可修改在 Mac 上显示的设备名、更换界面背景，或替换仅保留一张的相册背景。

# guide.body.setup_mac
source: 1) Tap any cell and choose a Mac app (.app) to assign. 2) Drag tiles to swap or move apps between cells. 3) Extra tabs (Apps1, …) add more pages; some tabs require an active subscription. 4) If you regenerate the pairing code on the Mac, each iPhone must reconnect with the new code.
zh_hans: 1）点按格子并选择要绑定的应用程序（.app）。 2）拖拽已配置的应用在格子间交换或移动。 3）多页 Tab（Apps、Apps1…）可扩展更多页面；部分页面可能需要订阅。 4）在 Mac 上重新生成配对码后，已配对的 iPhone 需用新码重新连接。

# guide.body.what
source: TreeletHub lets you arrange favorite Mac apps in a grid on the Mac, then open TreeletHub on your iPhone—on the same Wi‑Fi—to launch those apps remotely. Reorder slots with drag and drop on either side.
zh_hans: TreeletHub 让你在 Mac 上把常用应用摆成九宫格，再在同一个 Wi‑Fi 下的 iPhone 上远程点按启动；两端都支持拖拽调整格子顺序。

# guide.nav_title
source: User guide
zh_hans: 使用说明

# guide.title.ai_pad
source: AI control keyboard for vibe coding
zh_hans: AI 控制键盘 · 掌上 vibe coding

# guide.title.connect_ios
source: Connect from iPhone
zh_hans: 如何从 iPhone 连接

# guide.title.gestures_ios
source: Show desktop (iPhone)
zh_hans: 显示桌面（iPhone）

# guide.title.push_to_talk
source: Push to talk
zh_hans: 按住说话

# guide.title.scenarios
source: When it helps
zh_hans: 典型使用场景

# guide.title.setup_ios
source: After you are paired
zh_hans: 连接成功后（iPhone）

# guide.title.setup_mac
source: Set up the Mac hub
zh_hans: 如何在 Mac 上配置

# guide.title.what
source: What is TreeletHub?
zh_hans: TreeletHub 是什么？

# ios.alert.disconnect_title
source: Disconnected
zh_hans: 连接已断开

# ios.bg.preset.charcoalSilk
source: Charcoal
zh_hans: 炭灰

# ios.bg.preset.dawnBlush
source: Dawn blush
zh_hans: 晨曦

# ios.bg.preset.deepAzure
source: Deep azure
zh_hans: 深海

# ios.bg.preset.porcelainLight
source: Porcelain
zh_hans: 瓷白

# ios.bg.preset.royalPlum
source: Royal plum
zh_hans: 御紫

# ios.bg.preset.sageMist
source: Sage mist
zh_hans: 雾绿

# ios.bg.preset.system
source: Match system
zh_hans: 跟随系统

# ios.codex.action.accept
source: Accept
zh_hans: 接受

# ios.codex.action.approve
source: Approve
zh_hans: 批准

# ios.codex.action.attach
source: Attach files
zh_hans: 附加文件

# ios.codex.action.back
source: History back
zh_hans: 后退

# ios.codex.action.browser
source: Open browser
zh_hans: 打开浏览器

# ios.codex.action.commit
source: Git commit
zh_hans: Git 提交

# ios.codex.action.continue
source: Continue in new chat
zh_hans: 新会话继续

# ios.codex.action.decline
source: Decline
zh_hans: 拒绝

# ios.codex.action.fast
source: Fast mode
zh_hans: 快速模式

# ios.codex.action.focus
source: Focus ChatGPT
zh_hans: 聚焦 ChatGPT

# ios.codex.action.forward
source: History forward
zh_hans: 前进

# ios.codex.action.menu
source: Command menu
zh_hans: 命令菜单

# ios.codex.action.new
source: New chat
zh_hans: 新会话

# ios.codex.action.plan
source: Plan mode
zh_hans: 计划模式

# ios.codex.action.pr
source: Create pull request
zh_hans: 创建 PR

# ios.codex.action.ptt
source: Push to talk
zh_hans: 按住说话

# ios.codex.action.reasoning
source: Reasoning effort
zh_hans: 推理强度

# ios.codex.action.reject
source: Reject
zh_hans: 拒绝

# ios.codex.action.review
source: Review changes
zh_hans: 审查改动

# ios.codex.action.schedule
source: Scheduled tasks
zh_hans: 定时任务

# ios.codex.action.send
source: Send message
zh_hans: 发送

# ios.codex.action.settings
source: Settings
zh_hans: 设置

# ios.codex.action.sidebar
source: Toggle sidebar
zh_hans: 侧边栏

# ios.codex.action.terminal
source: Open terminal
zh_hans: 打开终端

# ios.codex.agent_source
source: Agent Keys follow
zh_hans: Agent 键跟随

# ios.codex.blocked_hint
source: Install the target app and allow Accessibility / Automation for TreeletHub on Mac.
zh_hans: 请安装目标应用，并在 Mac 上为 TreeletHub 开启辅助功能与自动化权限。

# ios.codex.brightness
source: Key brightness
zh_hans: 按键亮度

# ios.codex.cancel
source: Cancel
zh_hans: 取消

# ios.codex.chatgpt_connected
source: ChatGPT desktop linked
zh_hans: 已连接 ChatGPT 桌面端

# ios.codex.chatgpt_missing
source: Install or open ChatGPT on Mac
zh_hans: 请在 Mac 安装并打开 ChatGPT

# ios.codex.command_keys
source: Command Keys
zh_hans: 命令键

# ios.codex.control_target
source: Control target
zh_hans: 控制目标

# ios.codex.controlling_fmt
source: Controlling %@
zh_hans: 正在控制 %@

# ios.codex.cursor_pad_body
source: Agent status lights are Codex-only. This pad focuses on Chat, Accept/Reject, Terminal, and Command Palette.
zh_hans: Agent 状态灯仅用于 Codex。此页专注 Chat、接受/拒绝、终端与命令面板。

# ios.codex.cursor_pad_title
source: Cursor shortcuts
zh_hans: Cursor 快捷控制

# ios.codex.dial
source: Reasoning dial
zh_hans: 推理旋钮

# ios.codex.dial_composer
source: Dial: Composer navigation
zh_hans: 旋钮：编辑器导航

# ios.codex.dial_mode
source: Dial mode
zh_hans: 旋钮模式

# ios.codex.dial_reasoning
source: Dial: Reasoning only
zh_hans: 旋钮：仅调节推理

# ios.codex.fix_permission
source: Fix
zh_hans: 去授权

# ios.codex.idle_lights_fmt
source: Idle lights: %d sec
zh_hans: 空闲熄灯：%d 秒

# ios.codex.installed_idle
source: Installed
zh_hans: 已安装

# ios.codex.joy.down
source: Down
zh_hans: 下

# ios.codex.joy.left
source: Left
zh_hans: 左

# ios.codex.joy.right
source: Right
zh_hans: 右

# ios.codex.joy.up
source: Up
zh_hans: 上

# ios.codex.joystick
source: Skill joystick
zh_hans: 技能摇杆

# ios.codex.joystick_map
source: Joystick
zh_hans: 摇杆

# ios.codex.layer_fmt
source: Layer %d
zh_hans: 图层 %d

# ios.codex.link_accessibility
source: Mac Accessibility
zh_hans: Mac 辅助功能

# ios.codex.link_phone_mac
source: Phone ↔ Mac
zh_hans: 手机 ↔ Mac

# ios.codex.link_target_fmt
source: Target: %@
zh_hans: 目标：%@

# ios.codex.not_installed
source: Not installed
zh_hans: 未安装

# ios.codex.palette_dismiss
source: Got it
zh_hans: 知道了

# ios.codex.palette_enable_retry
source: Auto-type & retry
zh_hans: 开启自动输入并重试

# ios.codex.palette_hint_body_fmt
source: On Mac, type or select 「%@」. Or tap below to let TreeletHub type it for you.
zh_hans: 请在 Mac 上输入或选择「%@」。也可以点下方按钮，让 TreeletHub 自动输入。

# ios.codex.palette_hint_title
source: Command menu opened on Mac
zh_hans: 已在 Mac 打开命令菜单

# ios.codex.processing
source: Processing speech
zh_hans: 识别中

# ios.codex.ready_hint
source: Ready to control the selected Mac app.
zh_hans: 已就绪，可控制所选 Mac 应用。

# ios.codex.ready_to_send
source: Ready — tap Send
zh_hans: 可发送

# ios.codex.reasoning
source: Reasoning
zh_hans: 推理强度

# ios.codex.recording
source: Recording
zh_hans: 录音中

# ios.codex.reset_defaults
source: Reset to Codex defaults
zh_hans: 恢复官方默认布局

# ios.codex.running
source: Running
zh_hans: 运行中

# ios.codex.settings
source: Codex Micro Settings
zh_hans: Codex Micro 设置

# ios.codex.settings_footer
source: Mappings sync to the Mac and control ChatGPT / Codex. Agent Key colors approximate live thread state from local Codex data.
zh_hans: 键位映射同步到 Mac 并控制 ChatGPT / Codex。Agent 灯色基于本地 Codex 会话状态近似显示。

# ios.codex.settings_general
source: General
zh_hans: 常规

# ios.codex.source.custom
source: Custom assignments
zh_hans: 自定义分配

# ios.codex.source.pinned
source: Pinned chats
zh_hans: 置顶会话

# ios.codex.source.priority
source: Priority chats
zh_hans: 优先会话

# ios.codex.source.recent
source: Most recent chats
zh_hans: 最近会话

# ios.codex.status_bad
source: Offline
zh_hans: 未连接

# ios.codex.status_ok
source: Ready
zh_hans: 正常

# ios.codex.status.complete
source: Complete
zh_hans: 完成未读

# ios.codex.status.error
source: Error
zh_hans: 错误

# ios.codex.status.idle
source: Idle
zh_hans: 空闲

# ios.codex.status.input
source: Needs input
zh_hans: 等待输入

# ios.codex.status.off
source: Off
zh_hans: 未分配

# ios.codex.status.thinking
source: Thinking
zh_hans: 思考中

# ios.codex.subtitle.chatgpt
source: Chat pad · new chat, voice, send
zh_hans: 聊天控制台 · 新对话 / 语音 / 发送

# ios.codex.subtitle.codex
source: Agent pad · approve, skills, reasoning
zh_hans: Agent 控制台 · 批准 / Skills / 推理

# ios.codex.subtitle.cursor
source: IDE pad · chat, accept, terminal
zh_hans: IDE 控制台 · Chat / 接受 / 终端

# ios.codex.text_automation
source: Command palette auto-type
zh_hans: 命令面板自动输入

# ios.codex.text_automation_footer
source: Off by default. Some actions have no real shortcut, so TreeletHub types them into the command palette. If the palette fails to open, that text lands in the chat composer instead — keep this off unless you have verified it works.
zh_hans: 默认关闭。部分操作没有真实快捷键，需要 TreeletHub 向命令面板输入文字。若面板未能打开，这些文字会被打进聊天输入框。确认可用前请保持关闭。

# ios.common.cancel
source: Cancel
zh_hans: 取消

# ios.common.done
source: Done
zh_hans: 完成

# ios.common.ok
source: OK
zh_hans: 确定

# ios.common.save
source: Save
zh_hans: 保存

# ios.connect.button.connect
source: Connect
zh_hans: 连接

# ios.connect.button.connecting
source: Connecting…
zh_hans: 连接中…

# ios.connect.cached_hint
source: Loaded your last pairing code and trying to connect…
zh_hans: 已载入上次配对码，正在尝试自动连接…

# ios.connect.connecting
source: Connecting…
zh_hans: 正在连接…

# ios.connect.find_mac
source: Looking for your Mac…
zh_hans: 正在查找 Mac…

# ios.connect.intro
source: Enter the six-digit code shown in TreeletHub on your Mac. On the same Wi‑Fi, we discover the Mac and connect when the code matches.
zh_hans: 输入 Mac 上 TreeletHub 显示的 6 位配对码；在同一 Wi‑Fi 下会自动发现并匹配连接。

# ios.connect.pairing_label
source: Pairing code
zh_hans: 配对码

# ios.connect.pin_placeholder
source: Six-digit code
zh_hans: 6 位数字

# ios.connect.title
source: Connect to Mac
zh_hans: 连接 Mac

# ios.connect.wifi_hint
source: Stay on the same Wi‑Fi as your Mac. Allow Local Network the first time so discovery can work.
zh_hans: 请与 Mac 处于同一 Wi‑Fi；首次使用请在系统提示中允许「本地网络」。

# ios.disconnect.server_message
source: The connection from your Mac was closed.
zh_hans: Mac 端已关闭连接。

# ios.error.parse_message
source: We could not read a message from the Mac. Try connecting again.
zh_hans: 无法解析来自 Mac 的消息，请稍后重试连接。

# ios.error.pin_format
source: Enter exactly six digits—the pairing code from TreeletHub on your Mac.
zh_hans: 请输入 Mac 上 TreeletHub 显示的 6 位数字配对码。

# ios.error.unknown
source: Something went wrong.
zh_hans: 发生未知错误。

# ios.error.wrong_pin
source: That code did not match. Check the code on your Mac and try again.
zh_hans: 配对码不正确，请核对 Mac 上的显示后重试。

# ios.lang.chinese
source: Simplified Chinese
zh_hans: 简体中文

# ios.lang.current_en
source: English
zh_hans: 英语

# ios.lang.menu
source: Display language
zh_hans: 界面语言

# ios.lang.menu_a11y
source: Choose TreeletHub display language
zh_hans: 选择 TreeletHub 界面语言

# ios.lang.section
source: Language
zh_hans: 语言

# ios.settings.a11y.add_custom_bg
source: Photo background
zh_hans: 相册背景

# ios.settings.a11y.add_photo
source: Add photo background
zh_hans: 添加相册背景图

# ios.settings.a11y.custom_bg_hint
source: Tap to use this photo as the app background.
zh_hans: 点按以使用此照片作为应用背景。

# ios.settings.a11y.replace_photo
source: Replace photo background
zh_hans: 更换相册背景图

# ios.settings.ai_pad_footer
source: Needs Accessibility and Automation for TreeletHub on the Mac. Push to talk asks for Microphone and Speech Recognition on this iPhone the first time.
zh_hans: 需要在 Mac 上为 TreeletHub 开启辅助功能与自动化权限；首次使用「按住说话」请允许 iPhone 的麦克风与语音识别。

# ios.settings.ai_pad_p1
source: Tap ChatGPT, Codex, or Cursor in the Apps grid to open its control keyboard and drive the whole vibe-coding loop from your hand: start a run, approve or redirect the agent, and tune how hard it thinks — phone in hand, away from the keyboard.
zh_hans: 在 Apps 九宫格点按 ChatGPT、Codex 或 Cursor，进入它的控制键盘，把整个 vibe coding 循环握在手里：发起运行、批准或纠偏 agent、调节它思考的深浅——握着手机、离开键盘也能推进。

# ios.settings.ai_pad_p2
source: Hold PTT to speak. Your iPhone transcribes on-device, sends the text to the Mac composer, and you tap Send.
zh_hans: 按住「PTT」说话：语音在本机识别成文字后送到 Mac 输入框，再点 Send 发送。

# ios.settings.background_footer
source: One custom photo is kept at a time—use “+” to pick or replace it. Tap the thumbnail to use it as the background; press and hold to delete. Dark presets (Deep Azure, Royal Plum, Charcoal Silk) follow dark appearance.
zh_hans: 相册仅保留一张：用「+」选取或覆盖；点缩略图启用相册背景，长按删除。深海、御紫、炭灰等深色预设会跟随深色界面。

# ios.settings.delete_photo_bg
source: Remove photo background
zh_hans: 删除相册背景图

# ios.settings.device_footer
source: This label is what paired Macs show in their device list. Disconnect and connect again if you change it.
zh_hans: 此名称会显示在 Mac 的已连接设备列表中；修改后建议重新连接以立即生效。

# ios.settings.device_name_placeholder
source: Custom name (leave blank to use the device name)
zh_hans: 设备名称（留空则使用系统名称）

# ios.settings.disconnect
source: Disconnect from Mac
zh_hans: 断开与 Mac 的连接

# ios.settings.disconnect_footer
source: You will need to enter the pairing code again the next time you connect.
zh_hans: 断开后下次连接需要重新输入配对码。

# ios.settings.guide_link
source: User guide
zh_hans: 使用说明与连接

# ios.settings.restore
source: Restore purchases
zh_hans: 恢复购买

# ios.settings.section_ai_pad
source: AI control keyboard
zh_hans: AI 控制键盘

# ios.settings.section_background
source: Appearance
zh_hans: 背景

# ios.settings.section_device
source: Device
zh_hans: 设备

# ios.settings.section_subscription
source: Subscription & extra pages
zh_hans: 订阅与多页

# ios.settings.subscribed_local
source: Pro: Extra hub pages are unlocked on this iPhone.
zh_hans: Pro：本机已解锁多页九宫格（Apps1–Apps4）。

# ios.settings.subscribed_mac
source: Pro: Extra hub pages are included with your Mac subscription.
zh_hans: Pro：已由 Mac 端订阅解锁多页九宫格。

# ios.settings.subscription_paywall
source: Extra hub tabs (Apps1–Apps4) require either an active TreeletHub subscription on the Mac or an iOS Pro purchase when it is available in your region.
zh_hans: 多页 Tab（Apps1–Apps4）需要 Mac 端订阅有效，或在当地商店提供时购买 iOS Pro。

# ios.settings.title
source: Settings
zh_hans: 设置

# ios.shortcut.brightness
source: Brightness
zh_hans: 亮度

# ios.shortcut.copy
source: Copy
zh_hans: 复制

# ios.shortcut.media
source: Media
zh_hans: 媒体控制

# ios.shortcut.open_url
source: Open link
zh_hans: 打开链接

# ios.shortcut.paste
source: Paste
zh_hans: 粘贴

# ios.shortcut.screenshot_full
source: Screenshot — full screen
zh_hans: 全屏截图

# ios.shortcut.screenshot_region
source: Screenshot — selection
zh_hans: 区域截图

# ios.shortcut.select_all
source: Select all
zh_hans: 全选

# ios.shortcut.volume
source: Volume
zh_hans: 音量

# ios.slot.app
source: App
zh_hans: 应用

# ios.slot.empty
source: Empty
zh_hans: 空

# ios.tab.settings
source: Settings
zh_hans: 设置
